#include "info.h"
#include <QSysInfo>
#include <QString>
#include <QImage>
#include <QIcon>
#include <QLabel>
#include <QHeaderView>
#include <QVBoxLayout>

// Для отладки
#include <QMessageBox>

info::info(QDialog *parent) : QDialog(parent)
{
    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++ ИНИЦИАЛИЗАЦИЯ ОБЪЕКТОВ ++++++++++++++++++++++++++++++++++++++++++++++++ */
    /* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ НАСТРОЙКА ОБЪЕКТОВ  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
    /* ====================================================== ПОДКЛЮЧЕНИЕ К СИГНАЛАМ ================================================ */
    /* ...................................................... УПРАВЛЕНИЕ КОМПОНОВКОЙ ................................................ */
}

info::~info() {}
