#include "nettime.h"

#include <QMessageBox>

nettime::nettime(QDialog *parent) : QDialog(parent)
{
    QMessageBox::warning(this, tr("Information"), tr("The functionality is still under development."));
    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++ ИНИЦИАЛИЗАЦИЯ ОБЪЕКТОВ ++++++++++++++++++++++++++++++++++++++++++++++++ */
    /* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ НАСТРОЙКА ОБЪЕКТОВ  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
    /* ====================================================== ПОДКЛЮЧЕНИЕ К СИГНАЛАМ ================================================ */
    /* ...................................................... УПРАВЛЕНИЕ КОМПОНОВКОЙ ................................................ */
}

nettime::~nettime() {}
